app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params.except(:tag_names))
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "tags", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    respond_to do |format|
      format.turbo_stream { render turbo_stream: turbo_stream.update(@post), locals: @post, partials: 'posts/post' }
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "OK!"], ["updated_at", "2022-03-24 23:13:26.213531"], ["id", 1]]

  def update
    respond_to do |format|
      if @post.update(post_params.except(:tag_names))
---
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "OK!"], ["updated_at", "2022-03-24 23:13:26.213531"], ["id", 1]]

  def set_post
    @post = Post.find params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]